# DocumentOpeningEventArgs Properties

---
The DocumentOpeningEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancellable|  Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs)
| DocumentType|  Type of the document, e.g. Project or Template.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs)
| PathName|  Path of the document to be opened.
Top
#### Reference
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace